{
  "nodes": [
    {
      "op": "_ones", 
      "name": "_ones16", 
      "attr": {
        "dtype": "float32", 
        "shape": "[24]"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar33", 
      "attr": {"scalar": "1"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_embed_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[9705, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding0", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_4", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attr": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "[-1, 196, 512]"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "attr": {"axis": "1"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_inith_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot0", 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_inith_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus0", 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh0", 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_select_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 1]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot101", 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_select_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[1]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus67", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to66", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_features_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_features_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_features_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_features_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_features", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[69, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "w_featureproj_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 512]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot2", 
      "inputs": [[69, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_att_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus66", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_att_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 512]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot99", 
      "inputs": [[75, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims48", 
      "attr": {"axis": "1"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to64", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus95", 
      "inputs": [[90, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_att_att_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 1]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot100", 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape17", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax32", 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims49", 
      "attr": {"axis": "2"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to65", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul96", 
      "inputs": [[86, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul97", 
      "inputs": [[81, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat16", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[3, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_i2h_bias", 
      "attr": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t16_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t16_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[75, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus96", 
      "inputs": [[109, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t16_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_initc_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[70, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_initc_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus1", 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1", 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul98", 
      "inputs": [[116, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[114, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul99", 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t16_state", 
      "inputs": [[122, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t16_out", 
      "inputs": [[115, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_h_decode_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot102", 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_h_decode_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus68", 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_ctx2out_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot103", 
      "inputs": [[105, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus97", 
      "inputs": [[132, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus98", 
      "inputs": [[135, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh18", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_out_decode_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 9705]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot104", 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_out_decode_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[9705]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus69", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "argmax", 
      "name": "argmax0", 
      "attr": {"axis": "1"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims88", 
      "attr": {"axis": "0"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "embedding1", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[142, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot107", 
      "inputs": [[128, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus71", 
      "inputs": [[145, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to69", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus70", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot105", 
      "inputs": [[128, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims50", 
      "attr": {"axis": "1"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to67", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus99", 
      "inputs": [[149, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot106", 
      "inputs": [[154, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape18", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax33", 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims51", 
      "attr": {"axis": "2"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to68", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul100", 
      "inputs": [[86, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul101", 
      "inputs": [[148, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat17", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[144, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t17_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[163, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t17_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[128, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus100", 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t17_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul102", 
      "inputs": [[169, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[167, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul103", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t17_state", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t17_out", 
      "inputs": [[168, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot108", 
      "inputs": [[176, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus72", 
      "inputs": [[177, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot109", 
      "inputs": [[162, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus101", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus102", 
      "inputs": [[180, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh19", 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot110", 
      "inputs": [[182, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus73", 
      "inputs": [[183, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "argmax", 
      "name": "argmax1", 
      "attr": {"axis": "1"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims89", 
      "attr": {"axis": "0"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat36", 
      "attr": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[143, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "embedding2", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[185, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot113", 
      "inputs": [[176, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus75", 
      "inputs": [[189, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to72", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus74", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot111", 
      "inputs": [[176, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims52", 
      "attr": {"axis": "1"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to70", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus103", 
      "inputs": [[193, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot112", 
      "inputs": [[198, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape19", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax34", 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims53", 
      "attr": {"axis": "2"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to71", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul104", 
      "inputs": [[86, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul105", 
      "inputs": [[192, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat18", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[188, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t18_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[207, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t18_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[176, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus104", 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t18_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul106", 
      "inputs": [[213, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[211, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul107", 
      "inputs": [[215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t18_state", 
      "inputs": [[214, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t18_out", 
      "inputs": [[212, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot114", 
      "inputs": [[220, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus76", 
      "inputs": [[221, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot115", 
      "inputs": [[206, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus105", 
      "inputs": [[222, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus106", 
      "inputs": [[224, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh20", 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot116", 
      "inputs": [[226, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus77", 
      "inputs": [[227, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "argmax", 
      "name": "argmax2", 
      "attr": {"axis": "1"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims90", 
      "attr": {"axis": "0"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat37", 
      "attr": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[187, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "embedding3", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[229, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot119", 
      "inputs": [[220, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus79", 
      "inputs": [[233, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to75", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus78", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot117", 
      "inputs": [[220, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims54", 
      "attr": {"axis": "1"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to73", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus107", 
      "inputs": [[237, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot118", 
      "inputs": [[242, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape20", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax35", 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims55", 
      "attr": {"axis": "2"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to74", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul108", 
      "inputs": [[86, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul109", 
      "inputs": [[236, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat19", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[232, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t19_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[251, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t19_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[220, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus108", 
      "inputs": [[252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t19_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul110", 
      "inputs": [[257, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[255, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul111", 
      "inputs": [[259, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t19_state", 
      "inputs": [[258, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation39", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t19_out", 
      "inputs": [[256, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot120", 
      "inputs": [[264, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus80", 
      "inputs": [[265, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot121", 
      "inputs": [[250, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus109", 
      "inputs": [[266, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus110", 
      "inputs": [[268, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh21", 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot122", 
      "inputs": [[270, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus81", 
      "inputs": [[271, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "argmax", 
      "name": "argmax3", 
      "attr": {"axis": "1"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims91", 
      "attr": {"axis": "0"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat38", 
      "attr": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[231, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "embedding4", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[273, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot125", 
      "inputs": [[264, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus83", 
      "inputs": [[277, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to78", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus82", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot123", 
      "inputs": [[264, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims56", 
      "attr": {"axis": "1"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to76", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus111", 
      "inputs": [[281, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation40", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot124", 
      "inputs": [[286, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax36", 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims57", 
      "attr": {"axis": "2"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to77", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul112", 
      "inputs": [[86, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul113", 
      "inputs": [[280, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat20", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[276, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t20_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[295, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t20_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[264, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus112", 
      "inputs": [[296, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t20_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[299, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[299, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul114", 
      "inputs": [[301, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[299, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul115", 
      "inputs": [[303, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t20_state", 
      "inputs": [[302, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation41", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t20_out", 
      "inputs": [[300, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot126", 
      "inputs": [[308, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus84", 
      "inputs": [[309, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot127", 
      "inputs": [[294, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus113", 
      "inputs": [[310, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus114", 
      "inputs": [[312, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh22", 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot128", 
      "inputs": [[314, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus85", 
      "inputs": [[315, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "argmax", 
      "name": "argmax4", 
      "attr": {"axis": "1"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims92", 
      "attr": {"axis": "0"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat39", 
      "attr": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[275, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "embedding5", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[317, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot131", 
      "inputs": [[308, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus87", 
      "inputs": [[321, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to81", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus86", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot129", 
      "inputs": [[308, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims58", 
      "attr": {"axis": "1"}, 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to79", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus115", 
      "inputs": [[325, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation42", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot130", 
      "inputs": [[330, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape22", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax37", 
      "inputs": [[332, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims59", 
      "attr": {"axis": "2"}, 
      "inputs": [[333, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to80", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[334, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul116", 
      "inputs": [[86, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul117", 
      "inputs": [[324, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat21", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[320, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t21_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[339, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t21_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[308, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus116", 
      "inputs": [[340, 0, 0], [341, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t21_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[342, 0, 0]]
    }, 
    {
      "op": "Activation", 
