{
  "nodes": [
    {
      "op": "null", 
      "name": "captions", 
      "attr": {
        "__dtype__": "0", 
        "__shape__": "(24, 17)"
      }, 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attr": {
        "num_outputs": "17", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_embed_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[9705, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "word_vector", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_4", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_4", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_2", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attr": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "[-1, 196, 512]"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "attr": {"axis": "1"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_inith_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot0", 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_inith_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus0", 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh0", 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_select_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 1]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot5", 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_select_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[1]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus3", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to2", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_features_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_features_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_features_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_features_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_features", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[69, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "w_featureproj_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 512]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot2", 
      "inputs": [[69, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_att_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus2", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_att_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 512]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot3", 
      "inputs": [[75, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attr": {"axis": "1"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to0", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[90, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_att_att_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 1]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot4", 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax0", 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims1", 
      "attr": {"axis": "2"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to1", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[86, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[81, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[3, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_i2h_bias", 
      "attr": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t0_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t0_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[75, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[109, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_initc_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[70, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_initc_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus1", 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1", 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[116, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[114, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t0_state", 
      "inputs": [[122, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t0_out", 
      "inputs": [[115, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.5"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_h_decode_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot6", 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_h_decode_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus4", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_ctx2out_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[512, 256]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot7", 
      "inputs": [[105, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[133, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[136, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh2", 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attr": {"p": "0.5"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "w_out_decode_weight", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[256, 9705]"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot8", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_out_decode_bias", 
      "attr": {
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 3, \"factor_type\": \"avg\"}]", 
        "__shape__": "[9705]"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus5", 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log0", 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar16", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "one_hot", 
      "name": "one_hot0", 
      "attr": {"depth": "9705"}, 
      "inputs": [[1, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast0", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[1, 1, 0]]
    }, 
    {
      "op": "_ones", 
      "name": "_ones0", 
      "attr": {
        "dtype": "float32", 
        "shape": "[24]"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attr": {"scalar": "0"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "broadcast_not_equal", 
      "name": "broadcast_not_equal0", 
      "inputs": [[149, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast1", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims2", 
      "attr": {"axis": "1"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to3", 
      "attr": {"shape": "(24, 9705)"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[148, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attr": {"scalar": "0.0"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "word_vector", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[1, 1, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot11", 
      "inputs": [[128, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus7", 
      "inputs": [[160, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to6", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus6", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot9", 
      "inputs": [[128, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims3", 
      "attr": {"axis": "1"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to4", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[164, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot10", 
      "inputs": [[169, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax2", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims4", 
      "attr": {"axis": "2"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to5", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[86, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[163, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[159, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t1_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[178, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t1_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[128, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[182, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[182, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[184, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[182, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t1_state", 
      "inputs": [[185, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t1_out", 
      "inputs": [[183, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2", 
      "attr": {"p": "0.5"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot12", 
      "inputs": [[192, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus8", 
      "inputs": [[193, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot13", 
      "inputs": [[177, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[194, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[196, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh3", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout3", 
      "attr": {"p": "0.5"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot14", 
      "inputs": [[199, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus9", 
      "inputs": [[200, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax3", 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log1", 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar17", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "one_hot", 
      "name": "one_hot1", 
      "attr": {"depth": "9705"}, 
      "inputs": [[1, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast2", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[1, 2, 0]]
    }, 
    {
      "op": "_ones", 
      "name": "_ones1", 
      "attr": {
        "dtype": "float32", 
        "shape": "[24]"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attr": {"scalar": "0"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "broadcast_not_equal", 
      "name": "broadcast_not_equal1", 
      "inputs": [[207, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast3", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims5", 
      "attr": {"axis": "1"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to7", 
      "attr": {"shape": "(24, 9705)"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[206, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[158, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "word_vector", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[1, 2, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot17", 
      "inputs": [[191, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus11", 
      "inputs": [[218, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to10", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus10", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot15", 
      "inputs": [[191, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims6", 
      "attr": {"axis": "1"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to8", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[222, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot16", 
      "inputs": [[227, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax4", 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims7", 
      "attr": {"axis": "2"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to9", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[86, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[221, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[217, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t2_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[236, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t2_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[191, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[237, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[240, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[240, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[242, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[240, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t2_state", 
      "inputs": [[243, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t2_out", 
      "inputs": [[241, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout4", 
      "attr": {"p": "0.5"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot18", 
      "inputs": [[250, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus12", 
      "inputs": [[251, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot19", 
      "inputs": [[235, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[254, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh4", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout5", 
      "attr": {"p": "0.5"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot20", 
      "inputs": [[257, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus13", 
      "inputs": [[258, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax5", 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log2", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar18", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "one_hot", 
      "name": "one_hot2", 
      "attr": {"depth": "9705"}, 
      "inputs": [[1, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[262, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast4", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[1, 3, 0]]
    }, 
    {
      "op": "_ones", 
      "name": "_ones2", 
      "attr": {
        "dtype": "float32", 
        "shape": "[24]"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attr": {"scalar": "0"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "broadcast_not_equal", 
      "name": "broadcast_not_equal2", 
      "inputs": [[265, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast5", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims8", 
      "attr": {"axis": "1"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to11", 
      "attr": {"shape": "(24, 9705)"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[264, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[216, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "word_vector", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[1, 3, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot23", 
      "inputs": [[249, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus15", 
      "inputs": [[276, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to14", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus14", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot21", 
      "inputs": [[249, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims9", 
      "attr": {"axis": "1"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to12", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[280, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot22", 
      "inputs": [[285, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax6", 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims10", 
      "attr": {"axis": "2"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to13", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul18", 
      "inputs": [[86, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "context", 
      "attr": {"axis": "1"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul19", 
      "inputs": [[279, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[275, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t3_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[294, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t3_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[249, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[295, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t3_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[298, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[298, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[300, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[298, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[302, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t3_state", 
      "inputs": [[301, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t3_out", 
      "inputs": [[299, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout6", 
      "attr": {"p": "0.5"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot24", 
      "inputs": [[308, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus16", 
      "inputs": [[309, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot25", 
      "inputs": [[293, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[310, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[312, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh5", 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout7", 
      "attr": {"p": "0.5"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot26", 
      "inputs": [[315, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus17", 
      "inputs": [[316, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax7", 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log3", 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar19", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[319, 0, 0]]
    }, 
    {
      "op": "one_hot", 
      "name": "one_hot3", 
      "attr": {"depth": "9705"}, 
      "inputs": [[1, 4, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[320, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast6", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[1, 4, 0]]
    }, 
    {
      "op": "_ones", 
      "name": "_ones3", 
      "attr": {
        "dtype": "float32", 
        "shape": "[24]"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attr": {"scalar": "0"}, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "broadcast_not_equal", 
      "name": "broadcast_not_equal3", 
      "inputs": [[323, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast7", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims11", 
      "attr": {"axis": "1"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to15", 
      "attr": {"shape": "(24, 9705)"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[322, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[274, 0, 0], [331, 0, 0]]
    }, 
    {
      "op": "Embedding", 
      "name": "word_vector", 
      "attr": {
        "input_dim": "9705", 
        "output_dim": "256"
      }, 
      "inputs": [[1, 4, 0], [2, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot29", 
      "inputs": [[307, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus19", 
      "inputs": [[334, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "beta", 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to18", 
      "attr": {"shape": "(24, 512)"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_plus18", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot27", 
      "inputs": [[307, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims12", 
      "attr": {"axis": "1"}, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to16", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[340, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[338, 0, 0], [341, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[342, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot28", 
      "inputs": [[343, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attr": {"shape": "[-1, 196]"}, 
      "inputs": [[344, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax8", 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims13", 
      "attr": {"axis": "2"}, 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to17", 
      "attr": {"shape": "(24, 196, 512)"}, 
      "inputs": [[347, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[86, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "sum", 
